#Q1

read_csv(): This function is used to read data from a CSV file into a DataFrame.

In [2]:
import pandas as pd
#df = pd.read_csv('data.csv')

In [3]:
#Creating Dataframe
S1 = pd.Series(['Sourabh' , 'Shikhar' , 'Suyash' , 'vineet' , 'tanish'])
S2 = pd.Series([7.7 , 7.7 , 7.17 , 8.7 , 8.5]) 
df = pd.DataFrame({'Name': S1 , 'SGPA': S2})

In [4]:
df

      Name  SGPA
0  Sourabh  7.70
1  Shikhar  7.70
2   Suyash  7.17
3   vineet  8.70
4   tanish  8.50

head(): This function is used to display the first few rows of a DataFrame.

In [5]:
df.head()

      Name  SGPA
0  Sourabh  7.70
1  Shikhar  7.70
2   Suyash  7.17
3   vineet  8.70
4   tanish  8.50

In [6]:
df.head(2)

      Name  SGPA
0  Sourabh   7.7
1  Shikhar   7.7

info(): This function provides a concise summary of a DataFrame including the column names, non-null values, and data types.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   SGPA    5 non-null      float64
dtypes: float64(1), object(1)
memory usage: 208.0+ bytes

describe(): This function generates descriptive statistics of numerical columns in a DataFrame.

In [8]:
df.describe()

           SGPA
count  5.000000
mean   7.954000
std    0.632123
min    7.170000
25%    7.700000
50%    7.700000
75%    8.500000
max    8.700000

groupby(): This function is used to split the data into groups based on some criteria.

In [9]:
 grouped=df.groupby('SGPA')

In [10]:
for SGPA , group in grouped:
    print(SGPA)
    print(group)
    print()

7.17
     Name  SGPA
2  Suyash  7.17

7.7
      Name  SGPA
0  Sourabh   7.7
1  Shikhar   7.7

8.5
     Name  SGPA
4  tanish   8.5

8.7
     Name  SGPA
3  vineet   8.7

#Q2

In [11]:
def reindex_dataFrame(df):
    new_index = pd.Series(range(1, len(df)*2 ,2))
    return df.reset_index(drop=True).set_index(new_index)

# Example DataFrame
df = pd.DataFrame({'A': [1, 2, 3, 4],
                   'B': [5, 6, 7, 8],
                   'C': [9, 10, 11, 12]})

# Reindexing the DataFrame
new_df = reindex_dataFrame(df)

In [12]:
new_df

   A  B   C
1  1  5   9
3  2  6  10
5  3  7  11
7  4  8  12

#Q3

In [13]:
import pandas as pd
def calculate_sum_of_first_three(df):
    # Check if 'Values' column exists in the DataFrame
    if 'Values' not in df.columns:
        print("Error: 'values' column not found in the DataFrame.")
        return
    
    # Extract the first three values from the 'Values' column and calculate their sum
    first_three_sum = df['Values'].iloc[:3].sum()
    
     # Print the sum to the console
    print("Sum of the first three values in the 'Values' column:", first_three_sum)
    
# Example DataFrame
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

# Call the function
calculate_sum_of_first_three(df)

Sum of the first three values in the 'Values' column: 60

#Q4

In [14]:
def add_word_count_column(df , text_column ='Text' , new_column = 'Word_column'):
    df[new_column] = df[text_column].apply(lambda x: len(str(x).split()))
    return df

data ={'Text': ['This is a sampple text.' ,'Another Example' , 'Here we go with more text']}
df= pd.DataFrame(data)
df=add_word_count_column(df)
print(df)

                        Text  Word_column
0    This is a sampple text.            5
1            Another Example            2
2  Here we go with more text            6

#Q5

DataFrame.size and DataFrame.shape are both attributes of a Pandas DataFrame, but they serve different purposes:

DataFrame.size: This attribute returns the total number of elements in the DataFrame, which is calculated by multiplying the number of rows by the number of columns. It gives you the total count of values in the DataFrame.

In [15]:
df = pd.DataFrame({'A' : [1,2,'c'] , 'B' : [4,5,6]})
print(df.size)

6

DataFrame.shape: This attribute returns a tuple representing the dimensions of the DataFrame, i.e., the number of rows and columns. It's a tuple of the form (number_of_rows, number_of_columns).

In [16]:
print(df.shape)

(3, 2)

In [17]:
#Q6

In pandas, you use the read_excel() function to read data from an Excel file. This function allows you to read Excel files into a DataFrame.

In [18]:
"""df = pd.read_excel('filename.xlsx')"""

"df = pd.read_excel('filename.xlsx')"

#Q7

In [19]:
def username_of_email(df , Email_column ="username@domain.in" , username ='username'):
    df[username] = df[Email_column].apply(lambda x: (x.split('@')[0]))
    return df

#Q8

In [20]:
def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows
data ={'A':[3,8,6,2,9] , 'B':[5,2,9,3,1] , 'C':[1,7,4,5,2]}
df = pd.DataFrame(data)
selected_df = select_rows(df)
print(selected_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#Q9

In [21]:
import pandas as pd

def calculate_stats(df):
    """
    Calculate mean, median, and standard deviation of the 'Values' column in the DataFrame.

    Parameters:
    df (DataFrame): Pandas DataFrame containing the 'Values' column.

    Returns:
    dict: A dictionary containing mean, median, and standard deviation.
    """
    stats = {}
    
    # Calculate mean
    stats['mean'] = df['Values'].mean()
    
    # Calculate median
    stats['median'] = df['Values'].median()
    
    # Calculate standard deviation
    stats['std_dev'] = df['Values'].std()
    
    return stats

# Example usage:
# Assuming df is your DataFrame with a column 'Values'
# stats = calculate_stats(df)
# print(stats)

#Q10

In [22]:
def calculate_moving_average(df):
    df = df.sort_values(by='Date')
    df['Moving_Average']= df['Sales'].rolling(windows=7,min_periods=1).mean()
    return df

#Q11

In [34]:
def add_weekday_column(df):
    df['Date']=pd.to_datetime(df['Date'])
    df['Weekday']=df['Date'].dt.day_name()
    return df
data ={'Date':['2023-01-1','2023-01-2','2023-01-3','2023-01-4','2023-01-5']}
df_new =pd.DataFrame(data)
df_new =add_weekday_column(df_new)
print(df_new)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

#Q12

In [35]:
import pandas as pd

def select_date_range(df):
    # Convert 'Date' column to datetime if it's not already
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Select rows within the specified date range
    mask = (df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')
    selected_rows = df[mask]
    
    return selected_rows

#Q13